GopalSaraf/Practicals/PSDL/include/proc/pic16lf1786.inc
#define PSMC1PH8                         BANKMASK(PSMC1PHH), 0
#define PSMC1PH9                         BANKMASK(PSMC1PHH), 1
#define PSMC1PR0                         BANKMASK(PSMC1PRL), 0
#define PSMC1PR1                         BANKMASK(PSMC1PRL), 1
#define PSMC1PR10                        BANKMASK(PSMC1PRH), 2
#define PSMC1PR11                        BANKMASK(PSMC1PRH), 3
#define PSMC1PR12                        BANKMASK(PSMC1PRH), 4
#define PSMC1PR13                        BANKMASK(PSMC1PRH), 5
#define PSMC1PR14                        BANKMASK(PSMC1PRH), 6
#define PSMC1PR15                        BANKMASK(PSMC1PRH), 7
#define PSMC1PR2                         BANKMASK(PSMC1PRL), 2
#define PSMC1PR3                         BANKMASK(PSMC1PRL), 3
#define PSMC1PR4                         BANKMASK(PSMC1PRL), 4
#define PSMC1PR5                         BANKMASK(PSMC1PRL), 5
#define PSMC1PR6                         BANKMASK(PSMC1PRL), 6
#define PSMC1PR7                         BANKMASK(PSMC1PRL), 7
#define PSMC1PR8                         BANKMASK(PSMC1PRH), 0
#define PSMC1PR9                         BANKMASK(PSMC1PRH), 1
#define PSMC1SIE                         BANKMASK(PIE4), 0
#define PSMC1SIF                         BANKMASK(PIR4), 0
#define PSMC1TIE                         BANKMASK(PIE4), 4
#define PSMC1TIF                         BANKMASK(PIR4), 4
#define PSMC1TMR0                        BANKMASK(PSMC1TMRL), 0
#define PSMC1TMR1                        BANKMASK(PSMC1TMRL), 1
#define PSMC1TMR10                       BANKMASK(PSMC1TMRH), 2
#define PSMC1TMR11                       BANKMASK(PSMC1TMRH), 3
#define PSMC1TMR12                       BANKMASK(PSMC1TMRH), 4
#define PSMC1TMR13                       BANKMASK(PSMC1TMRH), 5
#define PSMC1TMR14                       BANKMASK(PSMC1TMRH), 6
#define PSMC1TMR15                       BANKMASK(PSMC1TMRH), 7
#define PSMC1TMR2                        BANKMASK(PSMC1TMRL), 2
#define PSMC1TMR3                        BANKMASK(PSMC1TMRL), 3
#define PSMC1TMR4                        BANKMASK(PSMC1TMRL), 4
#define PSMC1TMR5                        BANKMASK(PSMC1TMRL), 5
#define PSMC1TMR6                        BANKMASK(PSMC1TMRL), 6
#define PSMC1TMR7                        BANKMASK(PSMC1TMRL), 7
#define PSMC1TMR8                        BANKMASK(PSMC1TMRH), 0
#define PSMC1TMR9                        BANKMASK(PSMC1TMRH), 1
#define PSMC2BLKF0                       BANKMASK(PSMC2BLKF), 0
#define PSMC2BLKF1                       BANKMASK(PSMC2BLKF), 1
#define PSMC2BLKF2                       BANKMASK(PSMC2BLKF), 2
#define PSMC2BLKF3                       BANKMASK(PSMC2BLKF), 3
#define PSMC2BLKF4                       BANKMASK(PSMC2BLKF), 4
#define PSMC2BLKF5                       BANKMASK(PSMC2BLKF), 5
#define PSMC2BLKF6                       BANKMASK(PSMC2BLKF), 6
#define PSMC2BLKF7                       BANKMASK(PSMC2BLKF), 7
#define PSMC2BLKR0                       BANKMASK(PSMC2BLKR), 0
#define PSMC2BLKR1                       BANKMASK(PSMC2BLKR), 1
#define PSMC2BLKR2                       BANKMASK(PSMC2BLKR), 2
#define PSMC2BLKR3                       BANKMASK(PSMC2BLKR), 3
#define PSMC2BLKR4                       BANKMASK(PSMC2BLKR), 4
#define PSMC2BLKR5                       BANKMASK(PSMC2BLKR), 5
#define PSMC2BLKR6                       BANKMASK(PSMC2BLKR), 6
#define PSMC2BLKR7                       BANKMASK(PSMC2BLKR), 7
#define PSMC2DBF0                        BANKMASK(PSMC2DBF), 0
#define PSMC2DBF1                        BANKMASK(PSMC2DBF), 1
#define PSMC2DBF2                        BANKMASK(PSMC2DBF), 2
#define PSMC2DBF3                        BANKMASK(PSMC2DBF), 3
#define PSMC2DBF4                        BANKMASK(PSMC2DBF), 4
#define PSMC2DBF5                        BANKMASK(PSMC2DBF), 5
#define PSMC2DBF6                        BANKMASK(PSMC2DBF), 6
#define PSMC2DBF7                        BANKMASK(PSMC2DBF), 7
#define PSMC2DBR0                        BANKMASK(PSMC2DBR), 0
#define PSMC2DBR1                        BANKMASK(PSMC2DBR), 1
#define PSMC2DBR2                        BANKMASK(PSMC2DBR), 2
#define PSMC2DBR3                        BANKMASK(PSMC2DBR), 3
#define PSMC2DBR4                        BANKMASK(PSMC2DBR), 4
#define PSMC2DBR5                        BANKMASK(PSMC2DBR), 5
#define PSMC2DBR6                        BANKMASK(PSMC2DBR), 6
#define PSMC2DBR7                        BANKMASK(PSMC2DBR), 7
#define PSMC2DC0                         BANKMASK(PSMC2DCL), 0
#define PSMC2DC1                         BANKMASK(PSMC2DCL), 1
#define PSMC2DC10                        BANKMASK(PSMC2DCH), 2
#define PSMC2DC11                        BANKMASK(PSMC2DCH), 3
#define PSMC2DC12                        BANKMASK(PSMC2DCH), 4
#define PSMC2DC13                        BANKMASK(PSMC2DCH), 5
#define PSMC2DC14                        BANKMASK(PSMC2DCH), 6
#define PSMC2DC15                        BANKMASK(PSMC2DCH), 7
#define PSMC2DC2                         BANKMASK(PSMC2DCL), 2
#define PSMC2DC3                         BANKMASK(PSMC2DCL), 3
#define PSMC2DC4                         BANKMASK(PSMC2DCL), 4
#define PSMC2DC5                         BANKMASK(PSMC2DCL), 5
#define PSMC2DC6                         BANKMASK(PSMC2DCL), 6
#define PSMC2DC7                         BANKMASK(PSMC2DCL), 7
#define PSMC2DC8                         BANKMASK(PSMC2DCH), 0
#define PSMC2DC9                         BANKMASK(PSMC2DCH), 1
#define PSMC2EN                          BANKMASK(PSMC2CON), 7
#define PSMC2FFA0                        BANKMASK(PSMC2FFA), 0
#define PSMC2FFA1                        BANKMASK(PSMC2FFA), 1
#define PSMC2FFA2                        BANKMASK(PSMC2FFA), 2
#define PSMC2FFA3                        BANKMASK(PSMC2FFA), 3
#define PSMC2LD                          BANKMASK(PSMC2CON), 6
#define PSMC2PH0                         BANKMASK(PSMC2PHL), 0
#define PSMC2PH1                         BANKMASK(PSMC2PHL), 1
#define PSMC2PH10                        BANKMASK(PSMC2PHH), 2
#define PSMC2PH11                        BANKMASK(PSMC2PHH), 3
#define PSMC2PH12                        BANKMASK(PSMC2PHH), 4
#define PSMC2PH13                        BANKMASK(PSMC2PHH), 5
#define PSMC2PH14                        BANKMASK(PSMC2PHH), 6
#define PSMC2PH15                        BANKMASK(PSMC2PHH), 7
#define PSMC2PH2                         BANKMASK(PSMC2PHL), 2
#define PSMC2PH3                         BANKMASK(PSMC2PHL), 3
#define PSMC2PH4                         BANKMASK(PSMC2PHL), 4
#define PSMC2PH5                         BANKMASK(PSMC2PHL), 5
#define PSMC2PH6                         BANKMASK(PSMC2PHL), 6
#define PSMC2PH7                         BANKMASK(PSMC2PHL), 7
#define PSMC2PH8                         BANKMASK(PSMC2PHH), 0
#define PSMC2PH9                         BANKMASK(PSMC2PHH), 1
#define PSMC2PR0                         BANKMASK(PSMC2PRL), 0
#define PSMC2PR1                         BANKMASK(PSMC2PRL), 1
#define PSMC2PR10                        BANKMASK(PSMC2PRH), 2
#define PSMC2PR11                        BANKMASK(PSMC2PRH), 3
#define PSMC2PR12                        BANKMASK(PSMC2PRH), 4
#define PSMC2PR13                        BANKMASK(PSMC2PRH), 5
#define PSMC2PR14                        BANKMASK(PSMC2PRH), 6
#define PSMC2PR15                        BANKMASK(PSMC2PRH), 7
#define PSMC2PR2                         BANKMASK(PSMC2PRL), 2
#define PSMC2PR3                         BANKMASK(PSMC2PRL), 3
#define PSMC2PR4                         BANKMASK(PSMC2PRL), 4
#define PSMC2PR5                         BANKMASK(PSMC2PRL), 5
#define PSMC2PR6                         BANKMASK(PSMC2PRL), 6
#define PSMC2PR7                         BANKMASK(PSMC2PRL), 7
#define PSMC2PR8                         BANKMASK(PSMC2PRH), 0
#define PSMC2PR9                         BANKMASK(PSMC2PRH), 1
#define PSMC2SIE                         BANKMASK(PIE4), 1
#define PSMC2SIF                         BANKMASK(PIR4), 1
#define PSMC2TIE                         BANKMASK(PIE4), 5
#define PSMC2TIF                         BANKMASK(PIR4), 5
#define PSMC2TMR0                        BANKMASK(PSMC2TMRL), 0
#define PSMC2TMR1                        BANKMASK(PSMC2TMRL), 1
#define PSMC2TMR10                       BANKMASK(PSMC2TMRH), 2
#define PSMC2TMR11                       BANKMASK(PSMC2TMRH), 3
#define PSMC2TMR12                       BANKMASK(PSMC2TMRH), 4
#define PSMC2TMR13                       BANKMASK(PSMC2TMRH), 5
#define PSMC2TMR14                       BANKMASK(PSMC2TMRH), 6
#define PSMC2TMR15                       BANKMASK(PSMC2TMRH), 7
#define PSMC2TMR2                        BANKMASK(PSMC2TMRL), 2
#define PSMC2TMR3                        BANKMASK(PSMC2TMRL), 3
#define PSMC2TMR4                        BANKMASK(PSMC2TMRL), 4
#define PSMC2TMR5                        BANKMASK(PSMC2TMRL), 5
#define PSMC2TMR6                        BANKMASK(PSMC2TMRL), 6
#define PSMC2TMR7                        BANKMASK(PSMC2TMRL), 7
#define PSMC2TMR8                        BANKMASK(PSMC2TMRH), 0
#define PSMC2TMR9                        BANKMASK(PSMC2TMRH), 1
#define PSMC3BLKF0                       BANKMASK(PSMC3BLKF), 0
#define PSMC3BLKF1                       BANKMASK(PSMC3BLKF), 1
#define PSMC3BLKF2                       BANKMASK(PSMC3BLKF), 2
#define PSMC3BLKF3                       BANKMASK(PSMC3BLKF), 3
#define PSMC3BLKF4                       BANKMASK(PSMC3BLKF), 4
#define PSMC3BLKF5                       BANKMASK(PSMC3BLKF), 5
#define PSMC3BLKF6                       BANKMASK(PSMC3BLKF), 6
#define PSMC3BLKF7                       BANKMASK(PSMC3BLKF), 7
#define PSMC3BLKR0                       BANKMASK(PSMC3BLKR), 0
#define PSMC3BLKR1                       BANKMASK(PSMC3BLKR), 1
#define PSMC3BLKR2                       BANKMASK(PSMC3BLKR), 2
#define PSMC3BLKR3                       BANKMASK(PSMC3BLKR), 3
#define PSMC3BLKR4                       BANKMASK(PSMC3BLKR), 4
#define PSMC3BLKR5                       BANKMASK(PSMC3BLKR), 5
#define PSMC3BLKR6                       BANKMASK(PSMC3BLKR), 6
#define PSMC3BLKR7                       BANKMASK(PSMC3BLKR), 7
#define PSMC3DBF0                        BANKMASK(PSMC3DBF), 0
#define PSMC3DBF1                        BANKMASK(PSMC3DBF), 1
#define PSMC3DBF2                        BANKMASK(PSMC3DBF), 2
#define PSMC3DBF3                        BANKMASK(PSMC3DBF), 3
#define PSMC3DBF4                        BANKMASK(PSMC3DBF), 4
#define PSMC3DBF5                        BANKMASK(PSMC3DBF), 5
#define PSMC3DBF6                        BANKMASK(PSMC3DBF), 6
#define PSMC3DBF7                        BANKMASK(PSMC3DBF), 7
#define PSMC3DBR0                        BANKMASK(PSMC3DBR), 0
#define PSMC3DBR1                        BANKMASK(PSMC3DBR), 1
#define PSMC3DBR2                        BANKMASK(PSMC3DBR), 2
#define PSMC3DBR3                        BANKMASK(PSMC3DBR), 3
#define PSMC3DBR4                        BANKMASK(PSMC3DBR), 4
#define PSMC3DBR5                        BANKMASK(PSMC3DBR), 5
#define PSMC3DBR6                        BANKMASK(PSMC3DBR), 6
#define PSMC3DBR7                        BANKMASK(PSMC3DBR), 7
#define PSMC3DC0                         BANKMASK(PSMC3DCL), 0
#define PSMC3DC1                         BANKMASK(PSMC3DCL), 1
#define PSMC3DC10                        BANKMASK(PSMC3DCH), 2
#define PSMC3DC11                        BANKMASK(PSMC3DCH), 3
#define PSMC3DC12                        BANKMASK(PSMC3DCH), 4
#define PSMC3DC13                        BANKMASK(PSMC3DCH), 5
#define PSMC3DC14                        BANKMASK(PSMC3DCH), 6
#define PSMC3DC15                        BANKMASK(PSMC3DCH), 7
#define PSMC3DC2                         BANKMASK(PSMC3DCL), 2
#define PSMC3DC3                         BANKMASK(PSMC3DCL), 3
#define PSMC3DC4                         BANKMASK(PSMC3DCL), 4
#define PSMC3DC5                         BANKMASK(PSMC3DCL), 5
#define PSMC3DC6                         BANKMASK(PSMC3DCL), 6
#define PSMC3DC7                         BANKMASK(PSMC3DCL), 7
#define PSMC3DC8                         BANKMASK(PSMC3DCH), 0
#define PSMC3DC9                         BANKMASK(PSMC3DCH), 1
#define PSMC3EN                          BANKMASK(PSMC3CON), 7
#define PSMC3FFA0                        BANKMASK(PSMC3FFA), 0
#define PSMC3FFA1                        BANKMASK(PSMC3FFA), 1
#define PSMC3FFA2                        BANKMASK(PSMC3FFA), 2
#define PSMC3FFA3                        BANKMASK(PSMC3FFA), 3
#define PSMC3LD                          BANKMASK(PSMC3CON), 6
#define PSMC3PH0                         BANKMASK(PSMC3PHL), 0
#define PSMC3PH1                         BANKMASK(PSMC3PHL), 1
#define PSMC3PH10                        BANKMASK(PSMC3PHH), 2
#define PSMC3PH11                        BANKMASK(PSMC3PHH), 3
#define PSMC3PH12                        BANKMASK(PSMC3PHH), 4
#define PSMC3PH13                        BANKMASK(PSMC3PHH), 5
#define PSMC3PH14                        BANKMASK(PSMC3PHH), 6
#define PSMC3PH15                        BANKMASK(PSMC3PHH), 7
#define PSMC3PH2                         BANKMASK(PSMC3PHL), 2
#define PSMC3PH3                         BANKMASK(PSMC3PHL), 3
#define PSMC3PH4                         BANKMASK(PSMC3PHL), 4
#define PSMC3PH5                         BANKMASK(PSMC3PHL), 5
#define PSMC3PH6                         BANKMASK(PSMC3PHL), 6
#define PSMC3PH7                         BANKMASK(PSMC3PHL), 7
#define PSMC3PH8                         BANKMASK(PSMC3PHH), 0
#define PSMC3PH9                         BANKMASK(PSMC3PHH), 1
#define PSMC3PR0                         BANKMASK(PSMC3PRL), 0
#define PSMC3PR1                         BANKMASK(PSMC3PRL), 1
#define PSMC3PR10                        BANKMASK(PSMC3PRH), 2
#define PSMC3PR11                        BANKMASK(PSMC3PRH), 3
#define PSMC3PR12                        BANKMASK(PSMC3PRH), 4
#define PSMC3PR13                        BANKMASK(PSMC3PRH), 5
#define PSMC3PR14                        BANKMASK(PSMC3PRH), 6
#define PSMC3PR15                        BANKMASK(PSMC3PRH), 7
#define PSMC3PR2                         BANKMASK(PSMC3PRL), 2
#define PSMC3PR3                         BANKMASK(PSMC3PRL), 3
#define PSMC3PR4                         BANKMASK(PSMC3PRL), 4
#define PSMC3PR5                         BANKMASK(PSMC3PRL), 5
#define PSMC3PR6                         BANKMASK(PSMC3PRL), 6
#define PSMC3PR7                         BANKMASK(PSMC3PRL), 7
#define PSMC3PR8                         BANKMASK(PSMC3PRH), 0
#define PSMC3PR9                         BANKMASK(PSMC3PRH), 1
#define PSMC3SIE                         BANKMASK(PIE4), 2
#define PSMC3SIF                         BANKMASK(PIR4), 2
#define PSMC3TIE                         BANKMASK(PIE4), 6
#define PSMC3TIF                         BANKMASK(PIR4), 6
#define PSMC3TMR0                        BANKMASK(PSMC3TMRL), 0
#define PSMC3TMR1                        BANKMASK(PSMC3TMRL), 1
#define PSMC3TMR10                       BANKMASK(PSMC3TMRH), 2
#define PSMC3TMR11                       BANKMASK(PSMC3TMRH), 3
#define PSMC3TMR12                       BANKMASK(PSMC3TMRH), 4
#define PSMC3TMR13                       BANKMASK(PSMC3TMRH), 5
#define PSMC3TMR14                       BANKMASK(PSMC3TMRH), 6
#define PSMC3TMR15                       BANKMASK(PSMC3TMRH), 7
#define PSMC3TMR2                        BANKMASK(PSMC3TMRL), 2
#define PSMC3TMR3                        BANKMASK(PSMC3TMRL), 3
#define PSMC3TMR4                        BANKMASK(PSMC3TMRL), 4
#define PSMC3TMR5                        BANKMASK(PSMC3TMRL), 5
#define PSMC3TMR6                        BANKMASK(PSMC3TMRL), 6
#define PSMC3TMR7                        BANKMASK(PSMC3TMRL), 7
#define PSMC3TMR8                        BANKMASK(PSMC3TMRH), 0
#define PSMC3TMR9                        BANKMASK(PSMC3TMRH), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(EECON1), 0
#define RE3                              BANKMASK(PORTE), 3
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define RXSEL                            BANKMASK(APFCON1), 1
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCKSEL                           BANKMASK(APFCON1), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SDISEL                           BANKMASK(APFCON1), 3
#define SDOSEL                           BANKMASK(APFCON1), 5
#define SEN                              BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRCONA0                         BANKMASK(SLRCONA), 0
#define SLRCONA1                         BANKMASK(SLRCONA), 1
#define SLRCONA2                         BANKMASK(SLRCONA), 2
#define SLRCONA3                         BANKMASK(SLRCONA), 3
#define SLRCONA4                         BANKMASK(SLRCONA), 4
#define SLRCONA5                         BANKMASK(SLRCONA), 5
#define SLRCONA6                         BANKMASK(SLRCONA), 6
#define SLRCONA7                         BANKMASK(SLRCONA), 7
#define SLRCONB0                         BANKMASK(SLRCONB), 0
#define SLRCONB1                         BANKMASK(SLRCONB), 1
#define SLRCONB2                         BANKMASK(SLRCONB), 2
#define SLRCONB3                         BANKMASK(SLRCONB), 3
#define SLRCONB4                         BANKMASK(SLRCONB), 4
#define SLRCONB5                         BANKMASK(SLRCONB), 5
#define SLRCONB6                         BANKMASK(SLRCONB), 6
#define SLRCONB7                         BANKMASK(SLRCONB), 7
#define SLRCONC0                         BANKMASK(SLRCONC), 0
#define SLRCONC1                         BANKMASK(SLRCONC), 1
#define SLRCONC2                         BANKMASK(SLRCONC), 2
#define SLRCONC3                         BANKMASK(SLRCONC), 3
#define SLRCONC4                         BANKMASK(SLRCONC), 4
#define SLRCONC5                         BANKMASK(SLRCONC), 5
#define SLRCONC6                         BANKMASK(SLRCONC), 6
#define SLRCONC7                         BANKMASK(SLRCONC), 7
#define SMP                              BANKMASK(SSP1STAT), 7
#define SPEN                             BANKMASK(RC1STA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TX1STA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T1OSCR                           BANKMASK(OSCSTAT), 7
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define TMR0CS                           BANKMASK(OPTION_REG), 5
